# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.

def my_func(first: int, second: int, third: int) -> int:
    print(f'Сумма двух наибольших чисел равна: {first + second + third - min([first, second, third])}')


my_func(
    int(input('Введите первое число:')),
    int(input('Введите второе число:')),
    int(input('Введите третье число:')),
)
